profiling/results/stage-6_wrk_get.log
Running 1m test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 55.297ms, rate sampling interval: 324ms
  Thread calibration: mean lat.: 53.516ms, rate sampling interval: 302ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.69ms   14.30ms 211.84ms   93.23%
    Req/Sec    99.68      7.24   152.00     91.19%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.81ms
 75.000%   10.41ms
 90.000%   20.01ms
 99.000%   70.91ms
 99.900%  179.58ms
 99.990%  203.39ms
 99.999%  211.97ms
100.000%  211.97ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.239     0.000000            1         0.00
       4.055     0.100000         1001 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       4.711     0.200000         2001         0.00
       5.359     0.300000         3006        -0.00
       5.979     0.400000         4002        -0.00
       6.811     0.500000         5001         0.00
       7.311     0.550000         5498 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       7.959     0.600000         6001         0.00
       8.695     0.650000         6503        -0.00
       9.479     0.700000         7002        -0.00
      10.415     0.750000         7500         0.00
      11.079     0.775000         7750 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
      11.799     0.800000         7998         0.00
      12.791     0.825000         8249        -0.00
      14.303     0.850000         8498        -0.00
      16.687     0.875000         8747         0.00
      18.079     0.887500         8872 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
      20.031     0.900000         8997         0.00
      21.535     0.912500         9123        -0.00
      23.711     0.925000         9247        -0.00
      26.159     0.937500         9372         0.00
      28.319     0.943750         9434 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
      30.031     0.950000         9498         -nan
      32.479     0.956250         9559        -0.00
      34.975     0.962500         9622        -0.00
      37.855     0.968750         9684         0.00
      39.455     0.971875         9715 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
      41.439     0.975000         9747         -nan
      44.671     0.978125         9778        -0.00
      48.447     0.981250         9809        -0.00
      53.599     0.984375         9840         0.00
      59.231     0.985938         9856 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
      62.815     0.987500         9872         0.00
      67.775     0.989062         9887        -0.00
      73.983     0.990625         9903        -0.00
      79.743     0.992188         9918         0.00
      83.903     0.992969         9926 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      90.303     0.993750         9934         0.00
      97.215     0.994531         9942        -0.00
     109.951     0.995313         9950        -0.00
     125.119     0.996094         9957         0.00
     134.527     0.996484         9961 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
     139.391     0.996875         9965         -nan
     148.095     0.997266         9969        -0.00
     156.799     0.997656         9973        -0.00
     165.119     0.998047         9977         0.00
     166.143     0.998242         9979 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
     167.423     0.998437         9981         -nan
     175.231     0.998633         9984        -0.00
     176.767     0.998828         9985        -0.00
     180.991     0.999023         9987         0.00
     182.143     0.999121         9988 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
     185.343     0.999219         9989         0.00
     187.775     0.999316         9990        -0.00
     188.159     0.999414         9991        -0.00
     195.711     0.999512         9992         0.00
     195.711     0.999561         9992 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
     195.967     0.999609         9993         0.00
     195.967     0.999658         9993        -0.00
     202.495     0.999707         9994        -0.00
     202.495     0.999756         9994         0.00
     202.495     0.999780         9994 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
     203.391     0.999805         9995         -nan
     203.391     0.999829         9995        -0.00
     203.391     0.999854         9995        -0.00
     203.391     0.999878         9995         0.00
     203.391     0.999890         9995 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
     211.967     0.999902         9996         -nan
     211.967     1.000000         9996         0.00
#[Mean    =       10.690, StdDeviation   =       14.299]
#[Max     =      211.840, Total count    =         9996]
#[Buckets =           19, SubBuckets     =         2048]
----------------------------------------------------------
  12002 requests in 1.00m, 830.00KB read
Requests/sec:    200.00
Transfer/sec:     13.83KB