profiling/results/stage-6_wrk_put.log
Running 1m test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 15.178ms, rate sampling interval: 60ms
  Thread calibration: mean lat.: 16.101ms, rate sampling interval: 64ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.49ms   11.25ms 136.96ms   89.56%
    Req/Sec   100.51     18.46   174.00     75.02%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    9.38ms
 75.000%   14.22ms
 90.000%   24.38ms
 99.000%   57.09ms
 99.900%  112.96ms
 99.990%  135.93ms
 99.999%  137.09ms
100.000%  137.09ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.579     0.000000            1         0.00
       4.411     0.100000         1000 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       5.335     0.200000         2000         0.00
       6.479     0.300000         3004        -0.00
       7.779     0.400000         4002        -0.00
       9.375     0.500000         4999         0.00
      10.191     0.550000         5502 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
      10.943     0.600000         6000         0.00
      11.831     0.650000         6504        -0.00
      12.951     0.700000         7000        -0.00
      14.223     0.750000         7501         0.00
      14.951     0.775000         7750 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
      15.943     0.800000         7998         0.00
      17.263     0.825000         8249        -0.00
      18.975     0.850000         8500        -0.00
      21.087     0.875000         8749         0.00
      22.559     0.887500         8874 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
      24.383     0.900000         8998         0.00
      26.207     0.912500         9124        -0.00
      28.495     0.925000         9249        -0.00
      30.719     0.937500         9373         0.00
      32.063     0.943750         9435 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
      33.599     0.950000         9499         -nan
      35.263     0.956250         9560        -0.00
      37.503     0.962500         9624        -0.00
      39.935     0.968750         9685         0.00
      41.503     0.971875         9716 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
      43.295     0.975000         9748         -nan
      44.639     0.978125         9779        -0.00
      46.239     0.981250         9810        -0.00
      49.055     0.984375         9841         0.00
      50.719     0.985938         9857 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
      52.799     0.987500         9873         0.00
      54.335     0.989062         9888        -0.00
      58.015     0.990625         9904        -0.00
      61.535     0.992188         9919         0.00
      62.943     0.992969         9927 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      64.383     0.993750         9935         0.00
      69.119     0.994531         9943        -0.00
      71.871     0.995313         9951        -0.00
      80.127     0.996094         9958         0.00
      82.431     0.996484         9962 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      86.527     0.996875         9966         -nan
      90.815     0.997266         9970        -0.00
      93.439     0.997656         9974        -0.00
     101.119     0.998047         9978         0.00
     103.295     0.998242         9980 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
     105.407     0.998437         9982         -nan
     109.119     0.998633         9984        -0.00
     112.767     0.998828         9986        -0.00
     113.279     0.999023         9988         0.00
     113.535     0.999121         9989 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
     117.567     0.999219         9990         0.00
     119.103     0.999316         9991        -0.00
     123.135     0.999414         9992        -0.00
     124.735     0.999512         9993         0.00
     124.735     0.999561         9993 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
     125.695     0.999609         9994         0.00
     125.695     0.999658         9994        -0.00
     132.607     0.999707         9995        -0.00
     132.607     0.999756         9995         0.00
     132.607     0.999780         9995 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
     135.935     0.999805         9996         -nan
     135.935     0.999829         9996        -0.00
     135.935     0.999854         9996        -0.00
     135.935     0.999878         9996         0.00
     135.935     0.999890         9996 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
     137.087     0.999902         9997         -nan
     137.087     1.000000         9997         0.00
#[Mean    =       12.485, StdDeviation   =       11.246]
#[Max     =      136.960, Total count    =         9997]
#[Buckets =           19, SubBuckets     =         2048]
----------------------------------------------------------
  11998 requests in 1.00m, 785.03KB read
Requests/sec:    199.97
Transfer/sec:     13.08KB